import React from 'react'
import {Metadata} from "next";

export const metadata: Metadata = {
  title: 'Новини - Теплицька спортивна школа в Теплику',
  description: 'Дізнайтеся про останні новини та події у Теплицькій спортивній школі в місті Теплику. Ми регулярно оновлюємо інформацію про наші досягнення, заходи та інші цікаві події.',
  keywords: [
    'новини теплик',
    'новини теплицької спортивної школи',
    'новини теплицького спорту',
    'спортивні новини теплик',
    'теплицька спорт новини',
    'спортивні події теплик',
    'теплицькі новини про нас',
    'теплик спортивна школа новини',
    'теплик стадіон новини',
    'стадіон теплик новини',
    'події теплик новини',
    'події теплицької школи новини',
  ],
}

const Page = () => {
  return (
    <div className='h-[100dvh] flex items-center justify-center'>Сторінку ще не додано</div>
  )
}
export default Page
